{
  "_name_or_path": "roberta-large",
  "architectures": [
    "RobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "finetuning_task": "cola",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "unacceptable",
    "1": "acceptable"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "acceptable": 1,
    "unacceptable": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "max_seq_length": 64,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "sort_calculating": null,
  "static_heads": {
    "heads": {
      "0": [
        7,
        10,
        14,
        0,
        1,
        2,
        5,
        13,
        3,
        6,
        12,
        4,
        8
      ],
      "1": [
        5,
        6,
        0,
        12,
        3,
        2,
        8,
        15
      ],
      "2": [
        14,
        5,
        13,
        12,
        10,
        2,
        11,
        1,
        7,
        15
      ],
      "3": [
        2,
        15,
        5,
        3,
        7,
        12,
        9,
        1
      ],
      "4": [
        8,
        3,
        11,
        15,
        4,
        12,
        7,
        14
      ],
      "5": [
        11,
        0,
        8,
        6,
        4,
        5
      ],
      "6": [
        15,
        6,
        5,
        4,
        7,
        14,
        2
      ],
      "7": [
        8,
        5,
        13
      ],
      "8": [
        7,
        15,
        14,
        10,
        3
      ],
      "9": [
        6,
        5
      ],
      "10": [
        12,
        5,
        4,
        13,
        9,
        0
      ],
      "11": [
        8,
        6
      ],
      "12": [
        8,
        7,
        6,
        13,
        5
      ],
      "13": [
        8,
        9,
        3,
        0,
        4
      ],
      "14": [
        7,
        15,
        2,
        13,
        10
      ],
      "15": [
        4,
        2,
        0,
        14,
        15,
        5,
        1,
        7,
        9
      ],
      "16": [
        0,
        9,
        15,
        14,
        10,
        11
      ],
      "17": [
        1,
        3,
        7,
        6,
        4,
        15,
        9,
        2,
        14,
        10
      ],
      "18": [
        0,
        8,
        5,
        13,
        15,
        10,
        9,
        2
      ],
      "19": [
        15,
        11,
        3,
        8,
        7,
        5,
        12,
        4,
        13,
        6
      ],
      "20": [
        13,
        15,
        7,
        9,
        14,
        2,
        0,
        3,
        6,
        1,
        11,
        5,
        4,
        8
      ],
      "21": [
        11,
        1,
        3,
        4,
        10,
        0,
        8,
        7,
        12,
        6,
        13,
        9,
        14
      ],
      "22": [
        8,
        1,
        5,
        4,
        10,
        13,
        2,
        0,
        7,
        9,
        12,
        11,
        6,
        15,
        3
      ],
      "23": [
        1,
        11,
        6,
        14,
        2,
        0,
        10,
        8,
        12,
        13,
        15,
        4,
        9,
        3
      ]
    },
    "heads_dir": "../../constant-matrices/"
  },
  "transformers_version": "4.18.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "use_freeze_extract_pooler": true,
  "vocab_size": 50265
}
