{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "mrpc",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "not_equivalent",
    "1": "equivalent"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "equivalent": 1,
    "not_equivalent": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "max_seq_length": 64,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "sort_calculating": null,
  "static_heads": {
    "heads": {
      "0": [
        1,
        5,
        2,
        10,
        8,
        4,
        3,
        11,
        0,
        7,
        6,
        9
      ],
      "1": [
        6,
        3,
        5,
        2,
        1,
        10,
        0,
        8,
        9,
        7,
        4,
        11
      ],
      "2": [
        11,
        9,
        0,
        1,
        7,
        8,
        5,
        10,
        2,
        3,
        4,
        6
      ],
      "3": [
        10,
        9,
        11,
        8,
        5,
        6,
        2,
        0,
        4,
        1,
        3,
        7
      ],
      "4": [
        6,
        4,
        5,
        2,
        3,
        0,
        11,
        10,
        7,
        8,
        9,
        1
      ],
      "5": [
        3,
        9,
        0,
        7,
        1,
        11,
        6,
        4,
        5,
        10,
        2,
        8
      ],
      "6": [
        9,
        5,
        2,
        3,
        11,
        6,
        8,
        1,
        0,
        10,
        4,
        7
      ],
      "7": [
        11,
        0,
        6,
        8,
        9,
        10,
        2,
        5,
        1,
        7,
        3,
        4
      ],
      "8": [
        11,
        6,
        2,
        4,
        0,
        1,
        5,
        10,
        3,
        7,
        9,
        8
      ],
      "9": [
        2,
        7,
        4,
        3,
        5,
        1,
        6,
        9,
        10,
        11,
        0,
        8
      ],
      "10": [
        9,
        1,
        5,
        4,
        11,
        2,
        8,
        7,
        6,
        3,
        0,
        10
      ],
      "11": [
        0,
        10,
        4,
        7,
        6,
        11,
        1,
        8,
        2,
        3,
        5,
        9
      ]
    },
    "heads_dir": "../../constant-matrices/"
  },
  "transformers_version": "4.18.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "use_freeze_extract_pooler": true,
  "vocab_size": 30522
}
