{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "finetuning_task": "mrpc",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "not_equivalent",
    "1": "equivalent"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "equivalent": 1,
    "not_equivalent": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "max_seq_length": 64,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "sort_calculating": {
    "heads_dir": "../../constant-matrices/"
  },
  "static_heads": null,
  "transformers_version": "4.18.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "use_freeze_extract_pooler": true,
  "vocab_size": 30522
}
