{
  "_name_or_path": "xlm-roberta-base",
  "architectures": [
    "XLMRobertaForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "finetuning_task": "cola",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "unacceptable",
    "1": "acceptable"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "acceptable": 1,
    "unacceptable": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "max_seq_length": 64,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "sort_calculating": null,
  "static_heads": {
    "heads": {
      "0": [
        7,
        11,
        8,
        3,
        4,
        1,
        5,
        0,
        2,
        10,
        6,
        9
      ],
      "1": [
        11,
        6,
        8,
        0,
        2,
        5,
        10,
        1,
        9,
        4,
        7,
        3
      ],
      "2": [
        11,
        0,
        5,
        1,
        8,
        3,
        9,
        10,
        7,
        4,
        6,
        2
      ],
      "3": [
        6,
        1,
        11,
        5,
        7,
        3,
        2,
        4,
        10,
        8,
        0,
        9
      ],
      "4": [
        6,
        3,
        7,
        10,
        11,
        1,
        8,
        5,
        9,
        2,
        0,
        4
      ],
      "5": [
        6,
        3,
        10,
        7,
        2,
        1,
        0,
        4,
        5,
        9,
        8,
        11
      ],
      "6": [
        8,
        2,
        5,
        11,
        10,
        9,
        6,
        4,
        0,
        3,
        7,
        1
      ],
      "7": [
        9,
        1,
        11,
        2,
        3,
        8,
        0,
        5,
        10,
        7,
        4,
        6
      ],
      "8": [
        5,
        0,
        8,
        3,
        6,
        4,
        7,
        2,
        9,
        11,
        10,
        1
      ],
      "9": [
        10,
        6,
        5,
        8,
        0,
        1,
        7,
        2,
        11,
        9,
        4,
        3
      ],
      "10": [
        6,
        7,
        1,
        8,
        3,
        11,
        10,
        4,
        0,
        9,
        5,
        2
      ],
      "11": [
        5,
        1,
        10,
        2,
        4,
        8,
        11,
        3,
        9,
        7,
        0,
        6
      ]
    },
    "heads_dir": "../../constant-matrices/"
  },
  "transformers_version": "4.18.0",
  "type_vocab_size": 1,
  "use_cache": true,
  "use_freeze_extract_pooler": true,
  "vocab_size": 250002
}
