{
  "_name_or_path": "microsoft/deberta-base",
  "attention_probs_dropout_prob": 0.1,
  "finetuning_task": "mrpc",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "not_equivalent",
    "1": "equivalent"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "equivalent": 1,
    "not_equivalent": 0
  },
  "layer_norm_eps": 1e-07,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "max_seq_length": 64,
  "model_type": "deberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "c2p",
    "p2c"
  ],
  "position_biased_input": false,
  "relative_attention": true,
  "sort_calculating": null,
  "static_heads": {
    "heads": {
      "0": [
        6,
        11,
        7,
        10,
        3,
        2,
        5,
        9,
        1,
        8,
        4,
        0
      ],
      "1": [
        11,
        4,
        8,
        3,
        0,
        7,
        6,
        2,
        1,
        5,
        9,
        10
      ],
      "2": [
        4,
        7,
        6,
        0,
        11,
        3,
        5,
        10,
        8,
        1,
        9,
        2
      ],
      "3": [
        0,
        4,
        10,
        2,
        7,
        5,
        11,
        9,
        6,
        3,
        1,
        8
      ],
      "4": [
        0,
        2,
        6,
        10,
        8,
        11,
        3,
        9,
        4,
        1,
        5,
        7
      ],
      "5": [
        8,
        6,
        2,
        11,
        9,
        7,
        1,
        10,
        3,
        0,
        5,
        4
      ],
      "6": [
        5,
        0,
        10,
        8,
        6,
        2,
        3,
        1,
        11,
        9,
        4,
        7
      ],
      "7": [
        5,
        4,
        1,
        3,
        6,
        8,
        2,
        9,
        7,
        11,
        10,
        0
      ],
      "8": [
        5,
        7,
        3,
        11,
        10,
        6,
        9,
        1,
        2,
        8,
        4,
        0
      ],
      "9": [
        11,
        5,
        3,
        1,
        7,
        0,
        9,
        4,
        2,
        10,
        8,
        6
      ],
      "10": [
        0,
        11,
        1,
        8,
        4,
        2,
        9,
        3,
        6,
        7,
        5,
        10
      ],
      "11": [
        2,
        1,
        8,
        6,
        9,
        4,
        0,
        7,
        3,
        11,
        10,
        5
      ]
    },
    "heads_dir": "../../constant-matrices/"
  },
  "transformers_version": "4.18.0",
  "type_vocab_size": 0,
  "use_freeze_extract_pooler": true,
  "vocab_size": 50265
}
